alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721dlp_sysreg.h
#ifndef __INC_RTL8721D_LP_SYS_ON_BIT_H
#define __INC_RTL8721D_LP_SYS_ON_BIT_H

/* #define REG_AON_PWR_CTRL					0x0000 */
#define BIT_DSLP_SNOOZE_MODE_LSPAD_SHUTDOWN		BIT(24) /* R/W	1		1: Enable LSPAD when SNOOZE, 0: shutdown LSPAD when SNOOZE */

/* REG_AON_ISO_CTRL 0x0004 */
#define BIT_AON_CK32KGEN_FEN				BIT(26)	/* R/W	0		1: Enable SDM32K function,  0: disable */
#define BIT_AON_CTOUCH_FEN				BIT(22)	/* R/W	0		1: Enable Captouch function,  0: disable */
#define BIT_AON_TSF_FEN					BIT(20)	/* R/W	0		1: Enable DLPS TSF function,  0: disable */
#define BIT_AON_RTC_FEN					BIT(19)	/* R/W	0		1: Enable RTC function,  0: disable */
#define BIT_AON_KEYSCAN_FEN				BIT(18)	/* R/W	0		1: Enable Keyscan function, 0:disable */
#define BIT_AON_LPON_FEN					BIT(16)	/* R/W	0		LS Global reset, 1: Enable LS function, 0:disable */
#define BIT_AON_SHIFT_CK32K_CKSEL			12		/* R/W	0		*/
#define BIT_AON_MASK_CK32K_CKSEL			0x03	/* R/W	0		LS 32.768K clock selection, 00: 32.768K SDM, 01: 32.768K XTAL, 10/11: Exter 32.768K From GPIO */
#define BIT_AON_CK32KGEN_CKE				BIT(10)	/* R/W	0		1: Enable SDM32K clock,  0: disable */
#define BIT_AON_RTC_CK_SEL					BIT(8)	/* R/W	0		0: SDM32K clock select, 1:XTAL32K clock select */
#define BIT_AON_CTOUCH_CK_SEL				BIT(7)	/* R/W	0		0: tell CTC APB clock disabled, 1. tell CTC APB clock not disable */
#define BIT_AON_CTOUCH_CKE				BIT(6)	/* R/W	0		1: Enable Captouch clock,  0: disable */
#define BIT_AON_TSF_CKE					BIT(5)	/* R/W	0		1: Enable DLPS TSF clock,  0: disable */
#define BIT_AON_RTC_CKE					BIT(4)	/* R/W	0		1: Enable RTC clock,  0: disable */
#define BIT_AON_KEYSCAN_CKE				BIT(3)	/* R/W	0		1: Enable Keyscan clock, 0:disable */
#define BIT_AUX_FUNC_CLK_SEL				BIT(2)	/* R/W	0		"auxiliary function clock source selection,0: 32.768K, 1: 100k" */
#define BIT_AON_ANA4M_CKE					BIT(1)	/* R/W	0		BIT_AON_ANA4M_CKE	"1: Enable ANA4M clock for LS 0: Disable, This register is used by HW PMC, not for SW*/
#define BIT_AON_GCKANA_CKEN				BIT(0)	/* R/W	1		Enable 100K clock for AON register access */

/* REG_AON_BOOT_REASON1 0x000C */
#define BIT_MASK_AON_CHIP_VERSION_SW		0xF
#define BIT_SHIFT_AON_CHIP_VERSION_SW		8
#define BIT_AON_BOD_RESET_EN				BIT(7)	/* R/W	0		"1:  Enable to reset IC when BOD Reset happened0:  Disable"		Not reset by BOD */
#define BIT_MASK_AON_BOD_DBNC_CYC		0x3
#define BIT_SHIFT_AON_BOD_DBNC_CYC		5	/* R/W   0		Used by HW for BOD reset debounce logic Not reset by BOD */
#define BIT_AON_BOD_RESET_FLAG			BIT(4)	/* R/W	0		"1: BOD reset happenedSW need write 0 to clear this flag"		Not reset by BOD */
#define BIT_DSLP_RETENTION_RAM_PATCH		BIT(2)	/* R/W	0		1: DSLP retention RAM patch exists, need to execute*/
#define BIT_SW_SECURE_BOOT_FLAG			BIT(1)    /* RO	0		Read Only, Write Ignore, 1:  SW secure boot done*/
#define BIT_AON_BOOT_EXIT_DSLP			BIT(0)	/* R/W	0		1: Boot from DSLP */

/* REG_AON_LDO_CTRL0 0x0010 */

#define BIT_AON_V1833_SEL				BIT(26)	/* R/W	1		1:3.3V 0:1.8V */
/* BOD high threshold voltage  */
/* 3.3V RESET INTR	1.8V RESET INTR*/
/* 001 1.887  2.297 	001 1.422  1.498 */
/* 010 1.970 	2.397 	010 1.480  1.560 */
/* 011 2.061 	2.507 	011 1.543  1.627 */
/* 100 2.139 	2.602 	100 1.598  1.684 */
/* 101 2.224 	2.704 	101 1.656  1.746 */
/* 110 2.315 	2.815 	110 1.719  1.812 */
/* 111 2.388 	2.904 	111 1.770  1.865 */
#define BIT_MASK_BOD_THRESHOLD_H			0x7
#define BIT_SHIFT_BOD_THRESHOLD_H			23
/* BOD low threshold voltage  */
/* 3.3V RESET INTR	1.8V RESET INTR*/
/* 001 1.784  2.194 	001 1.345  1.422 */
/* 010 1.863 	2.290 	010 1.400  1.480 */
/* 011 1.949 	2.395 	011 1.460  1.543 */
/* 100 2.023 	2.486	100 1.512  1.598 */
/* 101 2.103 	2.584	101 1.567  1.656 */
/* 110 2.190 	2.690	110 1.627  1.719 */
/* 111 2.260 	2.775	111 1.674  1.770 */
#define BIT_MASK_BOD_THRESHOLD_L			0x7
#define BIT_SHIFT_BOD_THRESHOLD_L			20
#define BIT_POW_BOD_INTERRUPT			BIT(19)
#define BIT_POW_BOD_RESET				BIT(18)
#define BIT_AON_LDO_SLP_EN				BIT(16)
/* Digital LDO voltage  */
/* 0000: 0.600V  */
/* 0001: 0.631V  */
/* 0010: 0.660V  */
/* 0011: 0.692V  */
/* 0100: 0.719V  */
/* 0101: 0.749V  */
/* 0110: 0.782V  */
/* 0111: 0.817V  */
/* 1000: 0.856V  */
/* 1001: 0.899V  (default) */
/* 1010: 0.952V  */
/* 1011: 0.998V  */
/* 1100: 1.049V  */
/* 1101: 1.096V  */
/* 1110: 1.149V  */
/* 1111: 1.196V  */
#define BIT_MASK_AON_LDO_V09_ADJ		0xF
#define BIT_SHIFT_AON_LDO_V09_ADJ		12

/* #define REG_AON_LDO_CTRL1 0x0014 */
/* Psram ldo voltage  */
/* 0000: 1.636V  */
/* 0001: 1.662V  */
/* 0010: 1.6875V  */
/* 0011: 1.714V  */
/* 0100: 1.741V  */
/* 0101: 1.770V  */
/* 0110: 1.785V  */
/* 0111: 1.800V  */
/* 1000: 1.815V  */
/* 1001: 1.830V  */
/* 1010: 1.846V  */
/* 1011: 1.862V  */
/* 1100: 1.895V  */
/* 1101: 1.929V  */
/* 1110: 1.963V  */
/* 1111: 2.000V  */
#define BIT_MASK_LDO_PSRAM_ADJ			0xF
#define BIT_SHIFT_LDO_PSRAM_ADJ			17
#define BIT_LDO_PSRAM_SLEEP_EN			BIT(16)
#define BIT_LDO_PSRAM_EN				BIT(15)
/* lpldo voltage  */
/* 0000: 0.600V  */
/* 0001: 0.631V  */
/* 0010: 0.660V  */
/* 0011: 0.692V  */
/* 0100: 0.719V  */
/* 0101: 0.749V  */
/* 0110: 0.782V  */
/* 0111: 0.817V  */
/* 1000: 0.856V  */
/* 1001: 0.899V  (default) */
/* 1010: 0.952V  */
/* 1011: 0.998V  */
/* 1100: 1.049V  */
/* 1101: 1.096V  */
/* 1110: 1.149V  */
/* 1111: 1.196V  */
#define BIT_MASK_LDO_LP_ADJ				0xF
#define BIT_SHIFT_LDO_LP_ADJ			10
#define BIT_LDO_LP_SLEEP_EN				BIT(9)
#define BIT_LDO_LP_EN					BIT(8)

/* REG_MEM_PMCTRL_DSLP 0x001C */
#define BIT_PSW_ROM_PARA_SEL				BIT(8)	/* R/W	1		"SYSPMC ROM parameter selection under different voltage1: Select 1.1v memory parameter for ROM 0: Select 0.9v memory parameter for ROM"  */
#define BIT_AON_DLSP_RETRAM_SD			BIT(2)	/* R/W	0		Retension RAM SD control under Deep-sleep mode  */
#define BIT_AON_DLSP_RETRAM_DS			BIT(1)	/* R/W	0		Retension RAM DS control under Deep-sleep mode  */
#define BIT_AON_DLSP_RETRAM_LS			BIT(0)	/* R/W	0		Retension RAM LS control under Deep-sleep mode  */

/* REG_XTAL32K_CTRL0 0x0020 */
#define BIT_AON_SHIFT_XTAL32K_GM_3_0				28
#define BIT_AON_MASK_XTAL32K_GM_3_0				0x0F		/* [31:28]	R/W	1111		gm size */
#define BIT_AON_SHIFT_XTAL32K_CUR_REP_1_0		26
#define BIT_AON_MASK_XTAL32K_CUR_REP_1_0		0x03		/* [27:26]	R/W	00		replica buffer current */
#define BIT_AON_SHIFT_XTAL32K_CUR_GM_3_0		22
#define BIT_AON_MASK_XTAL32K_CUR_GM_3_0			0x0F		/* [25:22]	R/W	0100	awake gm current */
#define BIT_AON_SHIFT_XTAL32K_CUR_GM_INI_3_0	18
#define BIT_AON_MASK_XTAL32K_CUR_GM_INI_3_0		0x0F		/* [21:18]	R/W	1000		initial gm current */
#define BIT_AON_SHIFT_XTAL32K_CUR_MAIN_1_0		16
#define BIT_AON_MASK_XTAL32K_CUR_MAIN_1_0		0x03		/* [17:16]	R/W	01		xtal main current */
#define BIT_AON_XTAL32K_EN							BIT(0)		/* [0]	R/W	0		xtal enable  */

/* REG_XTAL32K_CTRL1 0x0024 */
#define BIT_AON_XTAL32K_SC_XO_EXTRA				BIT(21)		/* [21]	R/W	0		0: w/i 4pF cap 1: w/o 4pF cap */
#define BIT_AON_XTAL32K_SC_XI_EXTRA				BIT(20)		/* [20]	R/W	0		0: w/i 4pF cap 1: w/o 4pF cap */
#define BIT_AON_SHIFT_XTAL32K_GM_REP_2_0			17
#define BIT_AON_MASK_XTAL32K_GM_REP_2_0			0x07		/* [19:17]	R/W	0		repilca size */
#define BIT_AON_ENB_XTAL32K_FBRES					BIT(16)		/* [16]	R/W	0		0: enable feedback resistor */
#define BIT_AON_SHIFT_XTAL32K_TOK_1_0			14
#define BIT_AON_MASK_XTAL32K_TOK_1_0				0x03		/* [15:14]	R/W	11	00: 100ms 01:200ms 10:400ms 11: 800ms */
#define BIT_AON_SHIFT_XTAL32K_SC_XO_5_0			8
#define BIT_AON_MASK_XTAL32K_SC_XO_5_0			0x3F		/* [13:8]	R/W	100000		xo cap */
#define BIT_AON_SHIFT_XTAL32K_SC_XI_5_0			2
#define BIT_AON_MASK_XTAL32K_SC_XI_5_0			0x3F		/* [7:2]	R/W	100000		xi cap */
#define BIT_AON_EN_XTAL32K_CAP_AWAKE			BIT(1)		/* [1]	R/W	1		internal cap enable as awake */
#define BIT_AON_EN_XTAL32K_CAP_INITIAL			BIT(0)		/* [0]	R/W	1		internal cap enable as initial */

/* REG_OSC32K_CTRL 0x002C */
#define BIT_AON_1K_SEL_L							BIT(22)		/* [22]	R/W	0		"1K clock source selection0: Divided from OSC128K1: Divided from XTAL32K" */
#define BIT_AON_1K_SEL_H							BIT(21)		/* [21]	R/W	0		0: OSC128K 1:XTAL32K */
#define BIT_AON_SEL_LDO_VREF						BIT(20)		/* [20]	R/W	0		0: LDO low valtage setting 1:high voltage */
#define BIT_AON_SHIFT_OSC32K_RCAL_5_0			8
#define BIT_AON_MASK_OSC32K_RCAL_5_0				0x3F		/* [ 13 : 8 ] R / W 100000 osc frequency is highier as RCAL ' s larger  RG0X_32KOSC[5:0] */
#define BIT_AON_OSC32K_EN							BIT(0)		/* [0]	R/W	0		osc enable XTAL_POW[0] */

/* REG_AON_WAKE_TIMER0 0x0030 */
#define BIT_AON_WAKE_TM0_EN						BIT(31)		/* [31]	R/W	0		AON wake timer0 Enable */
#define BIT_AON_SHIFT_WAKE_TM0_TC				0
#define BIT_AON_MASK_WAKE_TM0_TC					0x3FFFFFFF	/* [29:0]	R/W	0		AON wake timer0 counter value */

