alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721dlp_sysreg.h
/* REG_AON_WAKE_TIMER0_CNT 0x0034 */
#define BIT_AON_TIMER_COUNTER					0x3FFFFFFF	/* [29:0]	R/W	0		AON current timer0 counter value */

/* REG_AON_PAD_CTRL 0x0038 */
#define BIT_PAD_RSTB33								BIT(17)		/* [17]	R/W	1		RSTB33 control of all PADs except AON */
#define BIT_AONPAD_RSTB33							BIT(1)		/* [1]	R/W	1		AON PAD(GPIO_C) RSTB33 control */
#define BIT_AONPAD_SHDN33							BIT(0)		/* [0]	R/W	1		AON PAD(GPIO_C) SHDN33/RSTB33 control */

/* REG_AON_WAKE_GPIO_CTRL1			0x003C  */
#define BIT_AON_SHIFT_WAKE_GPIO_DBNC_CYC		8
#define BIT_AON_MASK_WAKE_GPIO_DBNC_CYC			0x007FFF00	/* [22:8]	R/W	0		The GPIO signal will be filtered by the number of debounce cycles of specified in this register. (100k/128k) */
#define BIT_AON_WAKE_GPIO_DBNC_EN				BIT(7)		/* [7]	R/W	1		1: Enable gpio debounce */
#define BIT_AON_GPIO_WAKE_FEN						BIT(0)		/* [0]	R/W	0		1: Enable GPIO wake function */

/* REG_AON_WAKE_GPIO_CTRL2						0x0040  */
#define BIT_AON_SHIFT_GPIO_WAKE_EVENT			24
#define BIT_AON_MASK_GPIO_WAKE_EVENT			0x0F		/* [27:24]	R/W	0		"Wake event for wake pins,  1:  wake event detected, 0: no wake event bit3:  wake event of  wake pin3 bit2:  wake event of  wake pin2 bit1:  wake event of  wake pin1 bit0:  wake event of  wake pin0" */
#define BIT_AON_SHIFT_GPIO_WAKE_PUPD_EN			8
#define BIT_AON_MASK_GPIO_WAKE_PUPD_EN			0x0F		/* [11:8] 	R/W	0		"1: Enable the GPIO PAD's PU/PD resistence according to the wake pin polarity0: Disable" */
#define BIT_AON_SHIFT_GPIO_WAKE_POLARITY		0
#define BIT_AON_MASK_GPIO_WAKE_POLARITY			0x0F		/* [3:0]	R/W	0		"Wake pin polarity,  0:  high active,   1:  low activebit3:  wake pin3 polaritybit2:  wake pin2 polaritybit1:  wake pin1 polaritybit0:  wake pin0 polarity" */

/* REG_AON_DBNC_CTRL						0x0044  */
#define BIT_AON_CHIPEN_DBNC_FEN					BIT(16)		/* [16]	R/W	1		1: Enable CHIP_EN debounce function;  0: Disable */
#define BIT_AON_SHIFT_CHIPEN_DBNC_CYC			0
#define BIT_AON_MASK_CHIPEN_DBNC_CYC				0x7FFF		/* [14:0]	R/W	0x0100		CHIP_EN debounce cycles,  counted by 100K clock */

/* REG_AON_CK32KGEN_AD 0x0048 */
#define BIT_LS_SHIFT_SDM_ADDR				0			
#define BIT_LS_MASK_SDM_ADDR				0x3F	/* R/W	0		SDM register offset		*/

/* REG_AON_CK32KGEN_RWD 0x004C */
#define BIT_AON_SHIFT_SDM_DATA				0


/* REG_AON_PMC_CTRL					0x0050  */
#define BIT_AON_SHIFT_PMC_STL_LPLDO				16
#define BIT_AON_MASK_PMC_STL_LPLDO				0x3FF		/* [25:16]	R/W	0x0A0		stable time for LPLDO,  in unit of 100K clock cycle */
#define BIT_AON_SHIFT_PMC_PSW_STABLE				0
#define BIT_AON_MASK_PMC_PSW_STABLE				0x3FF		/* [9:0]	R/W	0x200		stable time for power switch between LPLDO and SWR,   in unit of 100K clock cycle */

/* REG_AON_PM_OPT						0x0054  */
#define BIT_AON_PMC_DSLP_ERCK						BIT(9) /* [9]	R/W	0		"1: Enable 100K clock for AON register access when PMC enter deep-sleep mode 0: Disable" */
#define BIT_AON_PMC_DSLP_LDHM						BIT(8) /* [8]	R/W	0		"1: Eanble AON LDO enter into sleep mode when  PMC enter deep-sleep mode0: Disable" */
#define BIT_AON_PMC_EN_SNOZ2NORM					BIT(2) /* [2]	R/W	1		"1: PMC exit Snooze state immediately after receive wakeup event0: Upon receiving wakeup event, PMC switch to Deepsleep from Snooze firstly, then PMC will exit from Deepsleep State to Normal" */
#define BIT_AON_PMC_DIRECT_PDN					BIT(1) /* [1]	R/W	0		1: Direct HW power-down,  0: SW power-down */
#define BIT_AON_PMC_SUPPORT_PDN					BIT(0) /* [0]	R/W	1		1: Aon pmc support power-down;  0: not supported, */

/* REG_AON_WAKE_OPT_MSK				0x0058  */
#define BIT_CHIP_PDB_MSK							BIT(7) /* [7]	R/W	0		1: Enable chip power-down interrupt */
#define BIT_CAPTOUCH_WAKE_MSK					BIT(6) /* [6]	R/W	0	 	1: Enable cap-touch wake */
#define BIT_KEYSCAN_WAKE_MSK						BIT(4) /* [4]	R/W	0		1: enable keyscan wake */
#define BIT_DLPS_TSF_WAKE_MSK						BIT(3) /* [3]	R/W	0		1: enable tsf wake under deep-lps mode */
#define BIT_RTC_WAKE_MSK							BIT(2) /* [2]	R/W	0		1: enable RTC wake */
#define BIT_AON_WAKE_TIM0_MSK					BIT(1) /* [1]	R/W	0		1: enable AON timer wake */
#define BIT_GPIO_WAKE_MSK							BIT(0) /* [0]	R/W	0		1: enable GPIO wake */

/* REG_AON_WAKE_OPT_STS				0x005C  */
#define BIT_CHIP_PDB_STS							BIT(7) /* [7]	R/W	0		1: Indicate chip power-down */
#define BIT_CAPTOUCH_WAKE_STS						BIT(6) /* [6]	R/W	0		1: Indicate captouch wake event */
#define BIT_KEYSCAN_WAKE_STS						BIT(4) /* [4]	R/W	0		1: Indicate keyscan wake */
#define BIT_DLPS_TSF_WAKE_STS						BIT(3) /* [3]	R/W	0		1: Indicate tsf wake under deep-lps mode */
#define BIT_RTC_WAKE_STS							BIT(2) /* [2]	R/W	0		1: Indicate RTC wake */
#define BIT_AON_WAKE_TIM0_STS						BIT(1) /* [1]	R/W	0		1: Indicate AON timer wake */
#define BIT_GPIO_WAKE_STS							BIT(0) /* [0]	R/W	0		1: Indicate GPIO wake */
#define BIT_ALL_WAKE_STS							0xFF

/* REG_AON_SNOOZE_MSK				0x0060  */
#define BIT_XTAL_REQ_SNOOZE_MSK					BIT(1) /* [1]	R/W	0		1: Enable xtal request event to trigger PMC enter snooze mode (for RTC SDM calibration) */
#define BIT_CAPTOUCH_SNOOZE_MSK					BIT(0) /* [0]	R/W	0		1: Enable captouch wake event to trigger PMC enter snooze mode */

/* REG_AON_SNOOZE_STS				0x0064  */
#define BIT_XTAL_REQ_SNOOZE_STS					BIT(1) /* [1]	R/W	0		1: Indicate xtal request event to trigger PMC enter snooze mode */
#define BIT_CAPTOUCH_SNOOZE_STS					BIT(0) /* [0]	R/W	0		1: Indicate captouch wake event to trigger PMC enter snooze mode */

/* REG_AON_CHIP_PWR_DOWN_MSK		0x0068 */
#define BIT_CHIP_PWR_DOWN_MSK					BIT(0) /* [0]	R/W	0		1: Enable chip power down wake event */

/* REG_AON_CHIP_PWR_DOWN_STS		0x006C  */
#define BIT_CHIP_PWR_DOWN_STS						BIT(0) /* [0]	R/W	0		1: Indicate chip power down wake event */

/* REG_AON_TSF_BCN_CFG1				0x0090  */
#define BIT_SHIFT_DLPS_BCN_SPACE					0
#define BIT_MASK_DLPS_BCN_SPACE					0xFFFFFF /* [24:0]	R/W	0		Beacon space for deep-lps, in unit of 32us */

/* REG_AON_TSF_BCN_CFG2				0x0094  */
#define BIT_SYNC_TSF_MAC_EN						BIT(31) /* [31]	R/W	0		1: Enable sync WIFI AON TSF to MAC TSF;  0: Disable, write1 will really sync TSF to MAC, and hardware will clear it automaticly */
#define BIT_SYNC_MAC_TSFT_EN						BIT(24) /* [24]	R/W	0		1: Enable sync WIFI MAC TSF to AON TSF;  0: Disable, write1 is just enable,  REG_TSF_SYNC[10] is used to sync MAC TSF */
#define BIT_SHIFT_MAC_TSF_OFFSET					16
#define BIT_MASK_MAC_TSF_OFFSET					0xFF /* [23:16]	R/W	0		Compensation value for WIFI MAC TSF sync to AON TSF */
#define BIT_SHIFT_DLPS_BCN_EARLY					0
#define BIT_DLPS_BCN_EARLY							0xFFFF /*[15:0]	R/W	0		beacon early interval for deep-lps, in unit of 32us */

/* SYSON REG */
/* REG_LP_PWR_ISO_CTRL 0x0200 */
#define BIT_LSYS_ISO_HSYSON				BIT(22) /* R/W	1		1: isolation signls from HS AON domain,   0: disable isolation */
#define BIT_LSYS_ISO_SYSPLL					BIT(21) /* R/W	1		1: isolation signls from SYSPLL domain,   0: disable isolation */
#define BIT_LSYS_ISO_LWLON					BIT(20) /* R/W	1		1: isolation signls from WLAN AON domain,   0: disable isolation */
#define BIT_LSYS_ISO_HSOC					BIT(18) /* R/W	1		1: isolation signls from HS platform domain,   0: disable isolation */
#define BIT_SYS_ISO_HPON 					BIT(17) /* 1: isolation signa from  HS  PERI-ON domain; 0: disable isolation */
#define BIT_SYS_ISO_LPSOC 					BIT(16) /* 1: isolation signls from LS platform domain,   0: disable isolation */

#define BIT_LSYS_LWLON_PWC_EN				BIT(4)	/* R/W	0		"1: Enable WLAN AON  power cut0: Disable" */
#define BIT_MASK_LSYS_HPLAT_PWC_EN_BIT3	BIT(3)	/* R/W	0		"2'b11: Enable HS platform  power cut2'b00: DisableNote:  When enable this power cut,  bit2 should be set to 1'b1 first, then delay 100us set bit 3 to 1'b1" */
#define BIT_MASK_LSYS_HPLAT_PWC_EN_BIT2	BIT(2)
#define BIT_LSYS_HPERI_PWC_EN				BIT(1)	/* R/W	0		"1: Enable HS PERI-ON  power cut0: Disable" */
#define BIT_LSYS_LPLAT_PWC_EN				BIT(0)	/* R/W	0		"1: Enable LS platform power cut0: Disable" */


/* REG_LP_KM0_CTRL 0x0204 */
#define BIT_LSYS_WDT_RESET_HS_ALL			BIT(15)	/* R/W	0		"1: watchdog will reset all the PERIs in HS,	0: watchdog will not reset all the PERIs in HS, uart0 & timer will not be reset and other PERIs will be reset"*/
#define BIT_LSYS_PLFM_WDTRST_OPT			BIT(13)	/*  R/W	0		0:  watchdog reset ls platform only,   1: reset hs/ls/spic platform */
#define BIT_LSYS_PLFM_AUTO_ICG_EN			BIT(12)	/* R/W	0	"1: Enable LS platform auto clock-gating for power save0: Disable" */
#define BIT_LSYS_SPIC_SPUDUP_SIM			BIT(11)	/* R/W	0	*/	
#define BIT_LSYS_PLFM_FLASH_SCE			BIT(10)	/* R/W	0	"1: Need decryption engine for the flash code0: No decryption for the flash code" */	
#define BIT_LSYS_PLFM_MST0_SEL				BIT(9)	/* R/W	0	"1: Enable SIC to access register by bus matrix0: KM0 " */	
#define BIT_KM0_RETENTEION_MODE			BIT(8)	/* R/W	0	"1: enable,  when KM0 reset, Cache will not be clear 0: Disable, when KM0 reset, Cache will be clear by HW" */	
#define BIT_KM0_DBG_RESTARTED				BIT(7)	/* RO	0	km_dbgrestarted_m, used for coresight debug */	
#define BIT_KM0_HALTED						BIT(6)	/* RO	0	km_halted_m, used for coresight debug */	
#define BIT_KM0_LOCKUP						BIT(5)	/* RO	0	km_lockup_m, used for coresight debug */	
#define BIT_KM0_SLEEPSYS					BIT(4)	/* RO	0	km_sl_sleepsys_r, used for __WFE */	


/* REG_LP_FUNC_EN0 0x0208 */
#define BIT_SYS_AMACRO_EN 					BIT(28) /* [28]	R/W	1 XTAL/AUX_ADC shutdown control 1. Enable 0: shutdown */
#define BIT_LSYS_LSOCFUN_FEN 				BIT(16)
#define BIT_LSYS_WLON_FEN 					BIT(12) /* WLON function enable 1: enable,  0: disable */
#define BIT_FLASH_FUN_EN					BIT(8) /* "Flash function enable1: enable flash;? 0: disable flash" */
#define BIT_LSYS_GDMA0_FEN					BIT(7)

#define BIT_SYS_KM0_EN 						BIT(4) /* 1: enable KM0, 0: reset */
#define BIT_SYS_PLATFORM_EN 				BIT(3) /* 1: enable LP platform ; 0: reset */
#define BIT_LSYS_SIC_FEN 					BIT(2)
#define BIT_SYS_FEN_EELDR 					BIT(1) /* 1: enable EE Loader; 0: disable EE loader */

/* REG_LP_FUNC_EN1 0x020C */
#define BIT_LSYS_GPIO0_FEN					BIT(20)
#define BIT_LSYS_QDEC0_FEN					BIT(16)
#define BIT_LSYS_SPGIO0_FEN				BIT(12)
#define BIT_LSYS_I2C0_FEN					BIT(10)
#define BIT_LSYS_ADC_FEN					BIT(8)
#define BIT_LSYS_UART1_FEN_FUN			BIT(7)
#define BIT_LSYS_UART1_FEN_GLB			BIT(6)
#define BIT_LSYS_UART0_FEN_FUN			BIT(5)
#define BIT_LSYS_UART0_FEN_GLB			BIT(4)
#define BIT_LSYS_TIMER0_FEN				BIT(2)
#define BIT_LSYS_IPC_FEN					BIT(1) /*	R/W	0		1: enable LS IPC function, 0: reset */
#define BIT_VENDOR_EN						BIT(0) /*	R/W	0		1: enable Vendor, 0: reset */


/* REG_LP_CLK_CTRL0 0x0210 */
#define BIT_LSYS_WLON_CKE 					BIT(12) /* to be add r26484 */
#define BIT_SHIFT_FLASH_CLK_SEL			9		/* R/W	0		"SPIC clock sel:2'b00: ANA4M2'b01: XTAL2'b10: 400M PLL divison clock"*/
#define BIT_MASK_FLASH_CLK_SEL			0x03
#define BIT_SHIFT_FLASH_CLK_ANA4M			(0x0 << BIT_SHIFT_FLASH_CLK_SEL)
#define BIT_SHIFT_FLASH_CLK_XTAL			(0x1 << BIT_SHIFT_FLASH_CLK_SEL)
#define BIT_SHIFT_FLASH_CLK_PLL			(0x2 << BIT_SHIFT_FLASH_CLK_SEL)
#define BIT_FLASH_CKE						BIT(8)	/* R/W	0		SPIC source clock enable */
#define BIT_LSYS_GDMA0_CKE					BIT(7)	/* R/W	0		*/
#define BIT_SHIFT_LPCPU_CLK_SEL			5
#define BIT_MASK_LPCPU_CLK_SEL				0x03 /*00: XTAL, 01: XTAL/2, 1x: ANA4M */
#define BIT_KM0_CLK_EN						BIT(4)	/* R/W	0		1: enable KM0 clock*/
#define BIT_PLATFORM_CLK_EN				BIT(3)	/* R/W	0		1: enable platform clock*/
#define BIT_SIC_CLK_EN						BIT(2)	/* R/W	0		1: enable SIC clock*/
#define BIT_SYSON_CK_EELDR_EN				BIT(1)	/* R/W	0		1: enable EE LDR clock; 0: gated EE LDR clock*/
#define BIT_SYSON_CK_SYSREG_EN			BIT(0)	/* R/W	0		1: Enable SYSON register clock; 0: gated SYSON Register clock*/




