alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721dlp_sysreg.h
/* REG_LP_CLK_CTRL1 0x0214 */
#define BIT_SHIFT_LPUART0_SCLK_SEL		24
#define BIT_MASK_LPUART0_SCLK_SEL			0x03	/* [25:24] lp uart0(loguart) rx clock, 00: xtal;    01: osc 2m;   10: xtal 2M */
#define BIT_SHIFT_LPUART1_SCLK_SEL		26
#define BIT_MASK_LPUART1_SCLK_SEL			0x03	/* [27:26] lp uart1 rx clock, 00: xtal;    01: osc 2m;   10: xtal 2M */

#define BIT_LSYS_GPIO0_CKSL				BIT(21)	/* R/W	0 	GPIO0 INT clock selecton: 0: LS APB clock 1: 32.768K clock from SDM */		
#define BIT_LSYS_GPIO0_CKE					BIT(20)	/* R/W	0	 */		
#define BIT_LSYS_QDEC0_CKSL_INTR			BIT(18)	/* R/W	0	 QDEC INT clock selecton: 1'b0: LS APB clock 1'b1: division clock from 2M/32K,  */		
#define BIT_LSYS_QDEC0_CKSL32K				BIT(17)	/* R/W	0	 "QDEC system clock sel:1'b0: from 2M OSC1'b1: from 32K" */	
#define BIT_LSYS_QDEC0_CKE					BIT(16)	/* R/W	0	 */		
#define BIT_LSYS_SPGIO0_CKSL_INTR			BIT(13)	/* R/W	0	 I2C system clock selection: 1'b0: LS APB clock 1'b1: OSC2M */		
#define BIT_LSYS_SPGIO0_CKE				BIT(12)	/* R/W	0	*/	
#define BIT_LSYS_I2C0_CKSL					BIT(11)	/* R/W	0	"I2C system clock sel:1'b0: from LS APB clock1'b1: from 2M OSC" */	
#define BIT_LSYS_I2C0_CKE					BIT(10)	/* R/W	0	 */		
#define BIT_LSYS_ADC_CKSL_INTR				BIT(9)	/* R/W	0	 ADC INT clock selection 0: LS APB clock 1: OSC2M */		
#define BIT_LSYS_ADC_CKE					BIT(8)	/* R/W	0	 1: enable LS ADC clock */		
#define BIT_LSYS_UART1_CKE					BIT(6)	/* R/W	0	 */		
#define BIT_LSYS_UART0_CKE					BIT(4)	/* R/W	0	LOGUART */		
#define BIT_LSYS_TIMER0_CKE				BIT(2)	/* R/W	0	 */		
#define BIT_LSYS_IPC_CKE 					BIT(1)
#define BIT_VENDOR_CKE 						BIT(0)

/* REG_LP_FLASH_CTRL 0x0218 */
#define BIT_FLASH_CAL_EN 					BIT(15) /* 15	R/W	1'b0	r_FLASH_CAL_EN	1: flash data will be sample by spic_clk_ps before sending to SPIC, 0: flash data sent to SPIC directly */
#define BIT_FLASH_CK_DIV_EN 				BIT(13) /* 13	R/W	1'b0	r_FLASH_CK_DIV_EN	1: enable to generate flash clock (no phase shift) divided by 400M pll clock, HW detect this signal's rising edge to start the no phase shift division circuit. */
#define BIT_FLASH_CK_PS_DIV_EN 			BIT(12) /* 12	R/W	1'b0	r_FLASH_CK_PS_DIV_EN	1: enable to generate flash clock (with phase shift) divided by 400M pll clock, HW detect this signal's rising edge to start the phase shift clock division circuit. */
#define BIT_SHIFT_DIV_INT					10
#define BIT_MASK_FLASH_DIV_INT			(0x03 << 10) /* 11:10	R/W	2'b0	r_FLASH_DIV_INT	Flash clock division ratio, integrate part, 0: divided by 2 1: divided by 3  2: divided by 4 3: RSVD */
#define BIT_FLASH_DIV_FRAC 					BIT(9) /* 9	R/W	1'b0	r_FLASH_DIV_FRAC	Flash clock division ratio, fractional part, 0: no fraction, only divided by integer set by bit[1:0],  1: 0.5 */
#define BIT_SHIFT_DIV_FRAC					9
#define BIT_FLASH_DIV_HIGH_FRAC 			BIT(8) /* 8	R/W	1'b0	r_FLASH_DIV_HIGH_FRAC	Only valid when r_FLASH_DIV_FRAC= 1, it decides the duty cycle of flash clock when not divided by integer, 1: duty cycle > 50% ; 0: duty cycle < 50% */
#define BIT_SHIFT_FLASH_CK_PS_INT			4
#define BIT_MASK_FLASH_CK_PS_INT			(0x07 << BIT_SHIFT_FLASH_CK_PS_INT) /* 6:4	R/W	3'b0	r_FLASH_CK_PS_INT	Flash clock phase shift in units of 400M pll clock cycels */
#define BIT_FLASH_PS_DIV_RDY 				BIT(3) /* 3	R	1'b0	r_FLASH_PS_DIV_RDY	ready flag of Flash clock with phase shift, Read only */
#define BIT_FLASH_DIV_RDY					BIT(2) /* 2	R	1'b0	r_FLASH_DIV_RDY	ready flag of Flash clock, Read only */

/* REG_LP_KM4_CTRL 0x021C */
#define BIT_SHIFT_LSYS_HCPU_CKSL			25 /* R/W	0		"KM4 CPU clock sel:3'b000: 200MHz3'b001: 100MHz3'b010: 50MHz3'b011: 25MHz3'b100: XTAL" */
#define BIT_MASK_LSYS_HCPU_CKSL			0x7
#define BIT_LSYS_HSYSON_AUX_CKE			BIT(17)	/* R/W	1		1: enable HSYSON aux clock when HS platform is disable, when this bit is set to 1, HSYSON clock switch to ANA4M 0: Disable */
#define BIT_LSYS_HPLAT_CKE					BIT(16)	/* R/W	0		1: enable KM4 & HS platform clock */
#define BIT_HS_SYSCKGEN_EN					BIT(4)	/* R/W	0		HS system clock generator function enable */
#define BIT_LSYS_HCPU_FEN					BIT(3)	/* R/W	0		1: enable KM4 function */
#define BIT_LSYS_HPLAT_FEN					BIT(2)	/* R/W	0		1: enable HS platform */
#define BIT_LSYS_HSOCFUN_FEN				BIT(1)	/* R/W	0		1: enable HS SOC function */
#define BIT_LSYS_HPONFUN_FEN				BIT(0)	/* R/W	0		1: enable HS Peripheral-ON Function ; 0: reset */

//BIT_MASK_SYS_EEROM_SWR_PAR_05_04 SWRLDO_STABLE_TIME
#define SWRLDO_STABLE_0064US					(0x00000000 << 28)
#define SWRLDO_STABLE_0128US					(0x00000001 << 28)
#define SWRLDO_STABLE_0512US					(0x00000002 << 28)
#define SWRLDO_STABLE_2048US					(0x00000003 << 28)

//BIT_MASK_SYS_EEROM_SWR_PAR_03_00 SWRLDO_12V
#define SWRLDO_12V_1P059						(0x00000000 << 24)
#define SWRLDO_12V_1P091						(0x00000001 << 24)
#define SWRLDO_12V_1P125						(0x00000002 << 24)
#define SWRLDO_12V_1P161						(0x00000003 << 24)
#define SWRLDO_12V_1P200						(0x00000004 << 24)
#define SWRLDO_12V_1P220						(0x00000005 << 24)
#define SWRLDO_12V_1P241						(0x00000006 << 24)
#define SWRLDO_12V_1P263						(0x00000007 << 24)
#define SWRLDO_12V_1P286						(0x00000008 << 24)
#define SWRLDO_12V_1P309						(0x00000009 << 24)
#define SWRLDO_12V_1P333						(0x0000000A << 24)
#define SWRLDO_12V_1P385						(0x0000000B << 24)
#define SWRLDO_12V_1P440						(0x0000000C << 24)
#define SWRLDO_12V_1P500						(0x0000000D << 24)
#define SWRLDO_12V_1P565						(0x0000000E << 24)
#define SWRLDO_12V_1P636						(0x0000000F << 24)

//BIT_MASK_SYS_EEROM_SWR_PAR_05_04 LDOH_12V
#define LDOH_12V_0P840V						(0x00000000 << 20)
#define LDOH_12V_0P857V						(0x00000001 << 20)
#define LDOH_12V_0P875V						(0x00000002 << 20)
#define LDOH_12V_0P893V						(0x00000003 << 20)
#define LDOH_12V_0P913V						(0x00000004 << 20)
#define LDOH_12V_0P933V						(0x00000005 << 20)
#define LDOH_12V_0P955V						(0x00000006 << 20)
#define LDOH_12V_0P977V						(0x00000007 << 20)
#define LDOH_12V_1P024V						(0x00000008 << 20)
#define LDOH_12V_1P077V						(0x00000009 << 20)
#define LDOH_12V_1P135V						(0x0000000A << 20)
#define LDOH_12V_1P167V						(0x0000000B << 20)
#define LDOH_12V_1P200V						(0x0000000C << 20)
#define LDOH_12V_1P235V						(0x0000000D << 20)
#define LDOH_12V_1P272V						(0x0000000E << 20)
#define LDOH_12V_1P313V						(0x0000000F << 20)

