alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721dlp_sysreg.h
/* REG_SYS_EFUSE_SYSCFG0 0x0220 */
/* 0x00~0x03 */
#define BIT_PMC_OPT_EN_SWR_XTAL				(0x00000001 << 16) /* default 1, PMC enable SWR&XTAL during power on */

/* REG_SYS_EFUSE_SYSCFG1 0x0224 */
/* 0x04~0x07 */

/* BIT_SWR_REG_ZCDC_H BIT [14:13] */
/* 00:0.1u(PFM) */
/* 01:0.2u */
/* 10:0.7u(PWM) */ /* default */
/* 11:0.8u */
#define BIT_MASK_SWR_REG_ZCDC_H				(0x00000003 << 13) /* [14:13]	R/W	2'b10	BIT_SWR_REG_ZCDC_H	"00:0.1u(PFM)01:0.2u10:0.7u(PWM)11:0.8u" */
#define BIT_SHIFT_SWR_REG_ZCDC_H			13
#define BIT_MASK_SWR_VOL_L1					0x0000000f/* [3:0] */
#define BIT_SWR_FPWM_L1						BIT(6) /* 1: force PWM, 0: force PFM */
/* value 		PWM current(mA)       PFM current (mA) */
/* 000            300                        100  */
/* 001            400                        150  */
/* 010            500                        200  */
/* 011            600                        250  */
/* 100            700                        300  (default) */
/* 101            800                        400  */
/* 110            900                        500  */
/* 111            1000                       VIN/10 */
#define BIT_MASK_SWR_OCP_L1					(0x00000007 << 8) /* [10:8]	R/W	3'b100	BIT_SWR_OCP_L1 */
#define BIT_SHIFT_SWR_OCP_L1				8

/* REG_SYS_EFUSE_SYSCFG2 0x0228 */
/* 0x0A */
#define BIT_MASK_SYS_EEROM_XTAL_FREQ_SEL		(0x0000000f << 16)
#define BIT_SHIFT_SYS_EEROM_XTAL_FREQ_SEL		16

/* REG_SYS_EFUSE_SYSCFG3 0x022C */
/* EFUSE 0xE */
#define BIT_MASK_BOOT_FLASH_BAUD_SEL			(0x00000001 << (7+16))
#define BIT_SHIFT_BOOT_FLASH_BAUD_SEL		(7+16)
#define BIT_SYS_SPIC_ADDR_4BYTE_EN			(0x00000001 << (6+16))
#define BIT_SYS_SPIC_BOOT_SPEEDUP_DIS			(0x00000001 << (5+16))
#define BIT_SYS_DIS_BOOT_LOG_EN				(0x00000001 << (4+16))
#define BIT_SYS_FLASH_DEEP_SLEEP_EN			(0x00000001 << (3+16))
#define BIT_SYS_FLASH_ENCRYPT_EN				(0x00000001 << (2+16))
#define BIT_SYS_RDP_EN							(0x00000001 << (1+16))
#define BIT_SYS_SWD_GP_SEL						(0x00000001 << (0+16)) /*!< SWD_DEFAULT_GPIO,  0: SWD at PB_9,PB_19, 1: SWD at PC_10,PC_11 */

/* EFUSE 0xF */
#define BIT_MASK_OSC4M_FEST					(0xF << 24)	/* 4MHz OSC Frequnce control */
#define BIT_SHIFT_OSC4M_FEST					(24)

/* REG_SWD_PMUX_EN				0x0230 */
#define BIT_LSYS_SWD_PMUX_EN				BIT(0)	/* R/W	1		"1: Eanble SWD pinmux enable function, 0: Disable(SWD pinmux disable by HW). BIT_LSYS_SWD_LOC(0x4800_022C[16]) is valid only when this bit is 1" */

/* REG_LP_SWR_CTRL0 0x0240 */
#define BIT_SHIFT_SWR_FREQ_L_SEL			28
#define BIT_MASK_SWR_FREQ_L_SEL			0xf

#define BIT_SHIFT_SWR_R3_L1_SEL			26
#define BIT_MASK_SWR_R3_L1_SEL			0x3
#define BIT_SHIFT_SWR_R2_L1_SEL			24
#define BIT_MASK_SWR_R2_L1_SEL			0x3
#define BIT_SHIFT_SWR_R1_L1_SEL			22
#define BIT_MASK_SWR_R1_L1_SEL			0x3

#define BIT_SHIFT_SWR_C3_L1_SEL			20
#define BIT_MASK_SWR_C3_L1_SEL			0x3
#define BIT_SHIFT_SWR_C2_L1_SEL			18
#define BIT_MASK_SWR_C2_L1_SEL			0x3
#define BIT_SHIFT_SWR_C1_L1_SEL			16
#define BIT_MASK_SWR_C1_L1_SEL			0x3


#define BIT_SHIFT_SYS_SPSLDO_VOL 			17
#define BIT_MASK_SYS_SPSLDO_VOL 			0x7
#define BIT_SHIFT_SYS_SWR12_IN 			14
#define BIT_MASK_SYS_SWR12_IN 			0x7

#define BIT_SYS_SWR_TYPE_L 				BIT(15)
#define BIT_SYS_FPWM_L1 					BIT(14)
#define BIT_SHIFT_SWR_STD_L1_SEL 			12
#define BIT_MASK_SWR_STD_L1_SEL 			0x3
#define BIT_SHIFT_SWR_VOL_L1_SEL 			8
#define BIT_MASK_SWR_VOL_L1_SEL 			0xf
#define BIT_REGU_LDOD_ENB 					BIT(4)
#define BIT_REGU_LDOM_EN 					BIT(3)
#define BIT_REGU_SWRM_EN 					BIT(2)
#define BIT_REGU_SLDO_EN 					BIT(1)
#define BIT_REGU_BG_EN 						BIT(0)

/* REG_LP_SWR_CTRL1 0x0244 */
#define BIT_SWR_ENFPWMDELAY_H				BIT(8) /* 1: PFM=>PWM Delay */

/* REG_LP_SWR_CTRL2 0x0248 */
#define BIT_MASK_SWR_COT_I_L				0x03 /* [6:5]	R/W	01	*/		
#define BIT_SHIFT_SWR_COT_I_L				5

/* REG_LP_LDO_CTRL0 0x0250 */
#define BIT_CK_100K_EN						BIT(18)
#define BIT_SHIFT_SYS_REGU_LDOE25_ADJ	8
#define BIT_MASK_SYS_REGU_LDOE25_ADJ		0xf
#define BIT_SYS_REGU_LDOE25_EN			BIT(0)

/* REG_LP_XTAL_CTRL1 0x0264 */
#define BIT_XTAL_AAC_GM_EN				BIT(29)

/* REG_LP_SYSPLL_CTRL0 0x0280 */
#define BIT_SHIFT_PLL_BG_VOL				4
#define BIT_MASK_PLL_BG_VOL				0x1ff
#define BIT_LP_PLL_MBIAS_EN				BIT(2)
#define BIT_LP_PLL_BG_I_EN					BIT(1)
#define BIT_LP_PLL_BG_EN					BIT(0)

/* REG_LP_OSC4M_CTRL				0x0290  */
#define BIT_OSC4M_WAKE_EN					BIT(4)	/* R/W	0		When this bit set to 1,  OSC4M can be OFF when KM0 enter sleep mode and PERI's wakeup INT can power on OSC4M */
#define BIT_OSC4M_EN						BIT(0)	/* R/W	0		Power on 4MHz OSC */

/* REG_LP_OSC2M_CTRL				0x0298  */
#define BIT_SHIFT_OSC2M_IB_SEL				24
#define BIT_MASK_OSC2M_IB_SEL				0xF		/* [27:24]	R/W	1000		iptat tuning for temperature variation. 0000:low freq. 1111:high freq. */
#define BIT_SHIFT_OSC2M_VCM_SEL			20
#define BIT_MASK_OSC2M_VCM_SEL			0xF		/* [23:20]	R/W	0000		comparator vcm */
#define BIT_SHIFT_OSC2M_C_SEL				16
#define BIT_MASK_OSC2M_C_SEL				0xF		/* [19:16]	R/W	0000		no use */
#define BIT_SHIFT_OSC2M_R_SEL				8
#define BIT_MASK_OSC2M_R_SEL				0xFF	/* [15:8]	R/W	10000000		11111111: low freq. 00000000:high freq. */
#define BIT_OSC2M_EN						BIT(0)	/* R/W	0		Enable OSC2M function */

/* REG_PLL_SYS_PS_REG 0x02C0 */
#define BIT_POW_CKGEN_400M			BIT(14)	/*	R/W	0		1: power on CK_400M/CK_400M_PS */
#define BIT_SHIFT_DIV_SEL				5		
#define BIT_DIV_SEL						(0x000001FF << BIT_SHIFT_DIV_SEL) /*!< The period of signal CK500M_SYNC/CK500M_PS_SYNC is: (r_DIV_SEL[8:0] + 2) cycles of 500MHz clock */
#define BIT_SHIFT_EN_CK_400M_PS		4		
#define BIT_EN_CK_400M_PS				(0x00000001 <<  BIT_SHIFT_EN_CK_400M_PS) /*!< 1: enable PLL 400M phase shift clock; 0: disable, Enable this bit when use FLASH_CalibrationPhase */
#define BIT_SHIFT_EN_CK_400M			3
#define BIT_EN_CK_400M					(0x00000001 <<  BIT_SHIFT_EN_CK_400M) /*!< 1: enable PLL 400M clock; 0: disable, HW auto enable this bit */
#define BIT_SHIFT_PHASE_SEL			0		
#define BIT_PHASE_SEL					(0x00000007 << 0) /*!< Phase selection for CK_500M_PS 0: 0,  1: 45, 2: 90, 3: 135, 4: 180,  5: 225, 6: 270, 7: 315 */

/* REG_MEM_CTRL2 */
#define BIT_LSYS_SLEP_RET_RAM_LS			BIT(22)	/* R/W	0		"1: Enable Retention RAM light-sleep when KM0 in sleep state0: Disable" */
#define BIT_LSYS_SLEP_RET_RAM_DS			BIT(21)	/* R/W	0		"1: Enable Retention RAM deep-sleep when KM0 in sleep state0: Disable"  */
#define BIT_LSYS_SLEP_RET_RAM_SD			BIT(20)	/* R/W	0		"1: Shut-down Retention RAM when KM0 in sleep state0: Power on Retention RAM when KM0 in sleep state"  */
#define BIT_LSYS_SLEP_IDCACHE_LS			BIT(19)	/* R/W	0		"1: Enable ICACHE/DCACHE light-sleep when KM0 in sleep state0: Disable"  */
#define BIT_LSYS_SLEP_KM0_RAM_LS			BIT(18)	/* R/W	0		"1: Enable CPU RAM light-sleep when KM0 in sleep state0: Disable"  */
#define BIT_LSYS_SLEP_KM0_RAM_DS			BIT(17)	/* R/W	0		"1: Enable CPU RAM deep-sleep when KM0 in sleep state0: Disable"  */
#define BIT_LSYS_SLEP_KM0_RAM_SD			BIT(16)	/* R/W	0		"1: Shut-down CPU RAM when KM0 in sleep state0: Power on CPU RAM when KM0 in sleep state"  */
#define BIT_LSYS_NORM_RET_RAM_LS			BIT(6)	/* R/W	0		"1: Enable Retention RAM light-sleep when KM0 in active state0: Disable"  */
#define BIT_LSYS_NORM_RET_RAM_DS			BIT(5)	/* R/W	0		"1: Enable Retention RAM deep-sleep when KM0 in active state0: Disable"  */
#define BIT_LSYS_NORM_RET_RAM_SD			BIT(4)	/* R/W	0		"1: Shut-down Retention RAM when KM0 in active state0: Power on Retention RAM when KM0 in active state"  */
#define BIT_LSYS_NORM_IDCACHE_LS			BIT(3)	/* R/W	0		"1: Enable ICACHE/DCACHE light-sleep when KM0 in active state0: Disable"  */
#define BIT_LSYS_NORM_KM0_RAM_LS			BIT(2)	/* R/W	0		"1: Enable CPU RAM light-sleep when KM0 in active state0: Disable"  */
#define BIT_LSYS_NORM_KM0_RAM_DS			BIT(1)	/* R/W	0		"1: Enable CPU RAM deep-sleep when KM0 in active state0: Disable"  */
#define BIT_LSYS_NORM_KM0_RAM_SD			BIT(0)	/* R/W	0		"1: Shut-down CPU RAM when KM0 in active state0: Power on CPU RAM when KM0 in active state" */


/* REG_LP_EFUSE_CTRL0 0x02E4 */
#define BIT_MASK_EFUSE_UNLOCK 			(0xff << 8)
#define BIT_SYS_EFUSE_LDALL 				BIT(1)
#define BIT_SYS_AUTOLOAD_SUS 				BIT(0)

/* REG_LP_EFUSE_CTRL1 0x02E8 */
#define BIT_SYS_EF_RWFLAG 					(0x00000001 << 31)
#define BIT_MASK_SYS_EF_PGPD 				(0x00000007 << 28)
#define BIT_MASK_SYS_EF_RDT 				(0x0000000f << 24)
#define BIT_MASK_SYS_EF_PGTS 				(0x0000000f << 20)
#define BIT_SYS_EF_ALDEN 					(0x00000001 << 18)
#define BIT_SHIFT_SYS_EF_ADDR 				8
#define BIT_MASK_SYS_EF_ADDR 				0x000003ff
#define BIT_MASK_SYS_EF_DATA 				(0x000000ff)

/* REG_LP_EFUSE_TEST 0x02EC */
#define BIT_SW_LDOE25_PC_EN				BIT(31)	/* R/W	0		SW Turn on power cut 25 */
#define BIT_SYS_EF_PD_DIS					BIT(30)	/* R/W	0		0: Enable Efuse power down,  1: Disable */
#define BIT_SYS_EF_CRES_SEL 				(0x00000001 << 29)  /* R/W	0		Efuse resistence selection, Efuse CRES selection, 0: 10k ;  1: 1.5k  */
#define BIT_SYS_EF_FORCE_PGMEN 			(0x00000001 << 10)
#define BIT_SYS_EF_CELL_SEL					(0x00000003 << 8)
#define BIT_SYS_EF_TRPT 					(0x00000001 << 7)
#define BIT_MASK_SYS_EF_SCAN_TTHD 		(0x0000007f)

/* REG_LP_RSIP_KEY_CTRL 0x2F0 */
#define BIT_OTF_KEY_REQ					BIT(0)

/* REG_LP_WL_INTR_CTRL 0x0310 */
#define BIT_WL_OFF_IMR					BIT(17)	
#define BIT_WL_ON_IMR					BIT(16)	
#define BIT_WL_OFF_ISR					BIT(1)
#define BIT_WL_ON_ISR					BIT(0)	

/* REG_LP_WL_POW_CTRL 0x0314 */
#define BIT_KM0_CLR_STATE					BIT(17)	/* R/W	0		1: KM0 CLR ready */
#define BIT_KM0_SET_STATE					BIT(16)	/* R/W	0		1: KM0 set ready */
#define BIT_REAL_STATE						BIT(9)	/* R	0		Ready2active real state */
#define BIT_REQ_STATE						BIT(8)	/* R	0		Req2active real state */
#define BIT_HW_AUTO_RSP_EN				BIT(0)	/* R/W	0		1: enable HW auto response */

/* REG_LP_SLP_WAKE_EVENT_MSK0		0x0300 */
#define BIT_LP_WEVT_HS_MSK			BIT(30)	/* [30]	R/W	0		1: enable HS Wakeup event; 0: disable the event to wakeup system */
#define BIT_LP_WEVT_AON_MSK			BIT(29)	/* [29]	R/W	0		1: enable AON Wakeup event; 0: disable the event to wakeup system */
#define BIT_LP_WEVT_SGPIO_MSK			BIT(28)	/* [28]	R/W	0		"1: enable SGPIO Wakeup event; 0: disable the event to wakeup system" */
#define BIT_LP_WEVT_COMP_MSK			BIT(27)	/* [27]	R/W	0		"1: enable Comparetor Wakeup  event; 0: disable the event to wakeup system" */
#define BIT_LP_WEVT_ADC_MSK			BIT(26)	/* [26]	R/W	0		1: enable ADC Wakeup event; 0: disable the event to wakeup system */
#define BIT_LP_WEVT_I2C_MSK			BIT(24)	/* [24]	R/W	0		1: enable I2C Wakeup event; 0: disable the event to wakeup system */
#define BIT_LP_WEVT_UART_MSK			BIT(20)	/* [20]	R/W	0		"1: enable UART Wakeup event; 0: disable the event to wakeup system" */
#define BIT_LP_WEVT_BOD_MSK			BIT(6)	/* [6]	R/W	0		1: enable BOD Wakeup event; 0: disable the event to wakeup system */
#define BIT_LP_WEVT_WLAN_MSK			BIT(5)	/* [5]	R/W	0		1: enable WLAN Wakeup event; 0: disable the event to wakeup system */
#define BIT_LP_WEVT_GPIO_MSK			BIT(4)	/* [4]	R/W	0		1: enable GPIO Wakeup event; 0: disable the event to wakeup system */
#define BIT_LP_WEVT_SWRD_OCP_MSK		BIT(2)	/* [2]	R/W	0		"1: enable DCORE SWR OCP wakeup  event; 0: disable the event to wakeup system" */
#define BIT_LP_WEVT_TIMER_MSK			BIT(1)	/* [1]	R/W	0		"1: enable timer Wakeup LP event; 0: disable the event to wakeup system" */

/* REG_LP_SLP_WAKE_EVENT_STATUS0	0x0304 */
#define BIT_LP_WEVT_HS_STS				BIT(30)	/* [30]	RO	0		1: Indicate HS Wakeup event */
#define BIT_LP_WEVT_AON_STS			BIT(29)	/* [29]	RO	0		1: Indicate AON Wakeup event (0x128) */
#define BIT_LP_WEVT_SGPIO_STS			BIT(28)	/* [28]	RO	0		1: Indicate SGPIO Wakeup event */
#define BIT_LP_WEVT_COMP_STS			BIT(27)	/* [27]	RO	0		1: Indicate Comparetor Wakeup  event */
#define BIT_LP_WEVT_ADC_STS			BIT(26)	/* [26]	RO	0		1: Indicate  ADC Wakeup  event */
#define BIT_LP_WEVT_I2C_STS			BIT(24)	/* [24]	RO	0		1: Indicate I2C  Wakeup  event */
#define BIT_LP_WEVT_UART_STS			BIT(20)	/* [20]	RO	0		1: Indicate UART  Wakeup  event */
#define BIT_LP_WEVT_BOD_STS			BIT(6)	/* [6]	RO	0		1: Indicate BOD Wakeup  event */
#define BIT_LP_WEVT_WLAN_STS			BIT(5)	/* [5]	RO	0		1: Indicate WLAN Wakeup  event */
#define BIT_LP_WEVT_GPIO_STS			BIT(4)	/* [4]	RO	0		1: Indicate GPIO Wakeup event */
#define BIT_LP_WEVT_SWRD_OCP_STS		BIT(2)	/* [2]	RO	0		1: Indicate DCORE SWR OCP event */
#define BIT_LP_WEVT_TIMER_STS			BIT(1)	/* [1]	RO	0		1: Indicate GTimer Wakeup system event; */

/* REG_LP_SLP_WAKE_EVENT_MSK1		0x0308 */
#define BIT_LP_BOD_MSK			BIT(0)	/* [0]	R/W	0		1: Enable BOD interrupt,  0: Disable */

/* REG_LP_SLP_WAKE_EVENT_STATUS1	0x030C */
#define BIT_LP_BOD_STS			BIT(0)	/* [0]	R/W	0		1: Indicate BOD interrupt event */

