alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721dlp_sysreg.h
/* REG_LP_PWRMGT_CTRL				0x0318 */
#define BIT_SHIFT_LSYS_PMC_TUTIME		16		/* [21:16]	R/W	0x3F		"PMC timeunit setting,  in cycles of ANA4M, e.g, default 0x3F,  timeunit = 16us" */
#define BIT_MASK_LSYS_PMC_TUTIME		0x3F	/* [21:16]	R/W			"PMC timeunit setting,  in cycles of ANA4M, e.g, default 0x3F,  timeunit = 16us" */
#define BIT_LSYS_PMC_OPT_BKPOFIMK1	BIT(9)	/* [9]	R/W	0		1: Enable to break PMC power-off flow when receiving wakeup event at pre-define stage1 */
#define BIT_LSYS_PMC_OPT_BKPOFIMK0	BIT(8)	/* [8]	R/W	0		1: Enable to break PMC power-off flow when receiving wakeup event at pre-define stage0 */
#define BIT_LSYS_SYSIRQ_MASK_POLL	BIT(4)	/* [4]	WO	0		1: Mask SYSIRQ INT before enter sleep mode, after write BIT_LSYS_PMC_PMEN_SLEP, SYSIRQ INT will be enabled by HW, 0: Invalid*/
#define BIT_LSYS_PMC_PMEN_SWR2LDO	BIT(3)	/* [3]	R/W	0		"1: Request PMC to Switch LS power from SWR to LPLDO auto clear to 0 after PMC finishes" */
#define BIT_LSYS_PMC_PMEN_LDO2SWR	BIT(2)	/* [2]	R/W	0		"1: Request PMC to Switch LS power from LPLDO to SWR auto clear to 0 after PMC finishes" */
#define BIT_LSYS_PMC_PMEN_SLEP		BIT(1)	/* [1]	R/W	0		"1: Request PMC to enter sleep state, auto clear to 0 after PMC finishes" */
#define BIT_LSYS_PMC_PMEN_DSLP		BIT(0)	/* [0]	R/W	0		"1: Request PMC to enter deep sleep state,auto clear to 0 after PMC finishes" */

/* REG_LP_PWRMGT_OPTION				0x0320 */
#define BIT_LSYS_PST_NORM_EXTL		BIT(17)	/* [17]	R/W	1		"1:  Enable XTAL when PMC exit from sleep mode0:  XTAL ON/OFF state keeps unchange when PMC exit from sleep mode" */
#define BIT_LSYS_PST_NORM_EPSW		BIT(16)	/* [16]	R/W	0		"" Whether to enable power switch when exit from sleep mode1:LS power switch to SWR when PMC exit from sleep mode0:LS power keeps unchange when PMC exit from sleep mode" */
#define BIT_LSYS_PST_DSLP_EACK			BIT(15)	/* [15]	R/W	0		"1: Enable ANA4M when PMC enter into deep sleep mode0: Disable ANA4M when PMC enter into deep sleep mode" */
#define BIT_LSYS_PST_DSLP_DPSW		BIT(14)	/* [14]	R/W	0		"Whether to disable power switch when enter into deepsleep mode1: Keep LS power unchange when PMC enter into deepsleep mode0: LS power switch to LPLDO when PMC enter into deepsleep mode" */
#define BIT_LSYS_PST_SLEP_XACT			BIT(10)	/* [10]	R/W	1		"1: XTAL keeps at active mode when PMC enter into sleep mode0: XTAL switch to LPS mode when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_EXTL			BIT(9)	/* [9]	R/W	0		"1: Enable XTAL when PMC enter into sleep mode0: Disable XTAL when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_ESWR		BIT(8)	/* [8]	R/W	0		"1: Enable SWR when PMC enter into sleep mode0: Disable SWR when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_EPWM		BIT(7)	/* [7]	R/W	1		"1: SWR keeps at PWM mode when PMC enter into sleep mode0: SWR switch to PFM when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_DPSW		BIT(6)	/* [6]	R/W	1		"Whether to disable power switch when enter into sleep mode1: Keep LS power unchange when PMC enter into sleep mode0: LS power switch to LPLDO when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_ERCK			BIT(5)	/* [5]	R/W	0		"1: Enable LS SYSON register clock when PMC enter into sleep mode0: Gate LS SYSON register clock when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_LDLM			BIT(4)	/* [4]	R/W	0		"1: LPLDO keeps at active mode when PMC enter into sleep mode0: LPLDO switch to sleep mode when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_EMPM		BIT(3)	/* [3]	R/W	0		"1: Memory power control setting don't change when PMC enter into sleep mode0: Memory power control setting will change(0xD4[1]) when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_EBUS			BIT(2)	/* [2]	R/W	0		"1: Enable platform clock when PMC entro into sleep mode0: Gate platform clock when PMC entro into sleep mode" */
#define BIT_LSYS_PST_SLEP_EACK			BIT(1)	/* [1]	R/W	1		"1: Enable ANA4M CLK when PMC enter into sleep mode 0: Disable ANA4M CLK when PMC enter into sleep mode" */
#define BIT_LSYS_PST_SLEP_ESOC			BIT(0)	/* [0]	R/W	0		"1: power enable SOC platform when PMC enter into sleep mode (clock-gating)0: power off SoC domain when PMC enter into sleep mode (power-gating)" */

/* REG_LP_RTC_XTAL_DIV_CTRL 0x0330 */
#define BIT_LP_SHIFT_RTC_DIV_XTAL32K		8
#define BIT_LP_MASK_RTC_DIV_XTAL32K		0x7FF//1221 [18:8]
#define BIT_LP_RTC_DIV_XTAL32K_EN			BIT(0)

/* REG_LP_UART_XTAL_DIV_CTRL			0x0334 */
#define BIT_LSYS_UART_XTAL_DIV_EN				BIT(16)	/*[16]	R/W			1: enable XTAL division circuit for UART */
#define BIT_LSYS_SHIFT_UART_XTAL_DIV_FREQ	0
#define BIT_LSYS_MASK_UART_XTAL_DIV_FREQ		0x7FFF	/* [14:0]	R/W	0x7D0		"output divided clock frequency for UART:BIT_LSYS_UART_XTAL_DIV_FREQ/1000  (MHz)" */


/* REG_SWR_PSW_CTRL					0x0338 */
#define BIT_LSYS_SHIFT_SWR_PSW_WAIT_CYC	24
#define BIT_LSYS_NASK_SWR_PSW_WAIT_CYC	0xFF	/* [31:24]	R/W	0xFF		"Wait time of each step during SWR voltage adjust process, the timeunit is control by 0x13C[21:16]: BIT_LSYS_ANAIP_CTL_TUTIMEDecrease voltage:  Step0 ->  Step1 -> Step2 -> Step3 -> Step4Increase voltage: Step4 ->  Step3 -> Step2 -> Step1 -> Step0" */
#define BIT_LSYS_SHIFT_SWR_REQ_DBNC_CYC	16
#define BIT_LSYS_MASK_SWR_REQ_DBNC_CYC	0xFF	/* [23:16]	R/W	0x1F		De-bounce time of SWR voltage adjust request from WIFI & SYSON PMC,   the timeunit is control by 0x13C[21:16]: BIT_LSYS_ANAIP_CTL_TUTIME */
#define BIT_LSYS_SHIFT_SWR_STEP1_VOL		12
#define BIT_LSYS_MASK_SWR_STEP1_VOL		0x0F	/* [15:12]	R/W	0x7		Step 1 voltage setting for SWR voltage adjust, default 1.043v */
#define BIT_LSYS_SHIFT_SWR_STEP2_VOL		8
#define BIT_LSYS_MASK_SWR_STEP2_VOL		0x0F	/* [11:8]	R/W	0x5		Step 2 voltage setting for SWR voltage adjust, default 1.000v */
#define BIT_LSYS_SHIFT_SWR_STEP3_VOL		4
#define BIT_LSYS_MASK_SWR_STEP3_VOL		0x0F	/* [7:4]	R/W	0x3		Step 3 voltage setting for SWR voltage adjust, default 0.941v */
#define BIT_LSYS_SHIFT_SWR_STEP4_VOL		0
#define BIT_LSYS_MASK_SWR_STEP4_VOL		0x0F	/* [3:0]	R/W	0x1		Step 4 voltage setting for SWR voltage adjust, default 0.906v */

/* REG_XMODE_SW_CTRL					0x033C */
#define BIT_LSYS_SHIFT_ANAIP_CTL_TUTIME	16
#define BIT_LSYS_MASK_ANAIP_CTL_TUTIME	0x3F	/* [21:16]	R/W	0xF		"Timeunit of  SWR/XTAL arbitration circuit, in unit of ANA4M,Default timeunit:  4us" */
#define BIT_LSYS_SHIFT_XTAL_BG2HPMOD_CYC	8
#define BIT_LSYS_MASK_XTAL_BG2HPMOD_CYC	0xFF	/* [15:8]	R/W	0x1F		The time interval between BG enable to XTAL switch to HP Mode,  the timeunit is control by 0x13C[21:16]: BIT_LSYS_ANAIP_CTL_TUTIME */
#define BIT_LSYS_SHIFT_XTAL_DBNC_CYC		0
#define BIT_LSYS_MASK_XTAL_DBNC_CYC		0x0F	/* [7:0]	R/W	0x1F		De-bounce time of XTAL enable request from WIFI & SYSON PMC,   the timeunit is control by 0x13C[21:16]: BIT_LSYS_ANAIP_CTL_TUTIME */

/* REG_GPIO_SHDN33_CTRL				0x0340 */
#define BIT_LSYS_SHIFT_WAKE_GPIO_VALUE	28
#define BIT_LSYS_MASK_WAKE_GPIO_VALUE	0x0F	/* [31:28]	R	0		Input value of AON wake GPIO */
#define BIT_LSYS_GPIO_GRP6_SHDN33			BIT(6)	/* [6]	R/W	1		" 1:  Enable GPIO Group6 0:  Shutdown GPIO Group6" */
#define BIT_LSYS_GPIO_GRP5_SHDN33			BIT(5)	/* [5]	R/W	1		" 1:  Enable GPIO Group5 0:  Shutdown GPIO Group5" */
#define BIT_LSYS_GPIO_GRP4_SHDN33			BIT(4)	/* [4]	R/W	1		" 1:  Enable GPIO Group4 0:  Shutdown GPIO Group4" */
#define BIT_LSYS_GPIO_GRP3_SHDN33			BIT(3)	/* [3]	R/W	1		" 1:  Enable GPIO Group3 0:  Shutdown GPIO Group3" */
#define BIT_LSYS_GPIO_GRP2_SHDN33			BIT(2)	/* [2]	R/W	1		" 1:  Enable GPIO Group2 0:  Shutdown GPIO Group2" */
#define BIT_LSYS_GPIO_GRP1_SHDN33			BIT(1)	/* [1]	R/W	1		" 1:  Enable GPIO Group1 0:  Shutdown GPIO Group1" */
#define BIT_LSYS_GPIO_GRP0_SHDN33			BIT(0)	/* [0]	R/W	1		" 1:  Enable GPIO Group0 0:  Shutdown GPIO Group0" */

/* REG_AUDIO_SHARE_PAD_CTRL			0x0344 */
#define BIT_LSYS_AC_ANA_PORB				BIT(9)	/* [9]	R/W	0		1: Enable Audio pad function, 0: disable */
#define BIT_LSYS_AC_MBIAS_POW				BIT(8)	/* [8]	R/W	0		1: Enable Audio bandgap,  0: disable */
#define BIT_LSYS_SHIFT_AC_LDO_REG			1
#define BIT_LSYS_MASK_AC_LDO_REG			0x7F	/* [7:1]	R/W	0		Audio LDO voltage setting */
#define BIT_LSYS_AC_LDO_POW				BIT(0)

