alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721dlp_sysreg.h
/* REG_BOD_DBNC_CTRL					0x0348 */
#define BIT_LSYS_BOD_DBNC_FEN				BIT(16)	/* [16]	R/W	1		1: Enable BOD de-bounce function */
#define BIT_LSYS_SHIFT_BOD_DBNC_CYC		0
#define BIT_LSYS_MASK_BOD_DBNC_CYC		0x7FFF	/* [14:0]	R/W	0x1000		BOD de-dounce time, in unit of ANA4M clock cycles */

/* REG_SYSON_PMC_PATCH_GRPx 0x0350~0x037F, x=1~6 */
#define BIT_LSYS_SHIFT_PATCH_GRPx_INSTR3	44
#define BIT_LSYS_MASK_PATCH_GRPx_INSTR3	0x3FFFF	/* [61:44]	R/W	0		instruction3 of PMC patch groupx */
#define BIT_LSYS_SHIFT_PATCH_GRPx_INSTR2	26
#define BIT_LSYS_MASK_PATCH_GRPx_INSTR2	0x3FFFF	/* [43:26]	R/W	0		instruction2 of PMC patch groupx */
#define BIT_LSYS_SHIFT_PATCH_GRPx_INSTR1	8
#define BIT_LSYS_MASK_PATCH_GRPx_INSTR1	0x3FFFF	/* R/W	0		instruction1 of PMC patch groupx */
#define BIT_LSYS_SHIFT_PATCH_GRPx_SADDR	0
#define BIT_LSYS_MASK_PATCH_GRPx_SADDR	0xFF	/* R/W	0		Start address of the first instruction of PMC patch groupx */

/* REG_LP_GDMA_CTRL 0x0380 */
#define BIT_LSYS_GDMA_CLK_ALWAYS_DISABLE	BIT(5)	/* R/W	0		Disable dmac clk all the time. if clk_always_enable=0 and clk_always_disable=1,  the whole dmac¡¯s clk will be shut down to save power. */
#define BIT_LSYS_GDMA_CLK_ALWAYS_ENABLE		BIT(4)	/* R/W	0		Enable dmac clk all the time. It has the highest priority. If clk_always_enable=0 and clk_always_disable=0, dmac can shut any channel¡¯s clk when this channel has no job to save power. If clk_always_enable=1, all the channel¡¯s clk will be valid. */

/* REG_LP_EFUSE_PROTECTION 0x03E0 */
#define EFUSE_PHYSICAL_SBOOT_ON		BIT_SECURE_BOOT_DIS
#define BIT_CPU_PC_DBGEN				BIT(14)	/* R	1		"1: Enable to get KM4/KM0 PC value through debug port0: Disable" */
#define BIT_SECURE_BOOT_DIS			BIT(13)	/* R	1		1: Disable Secure boot ,  0: Enable */
#define BIT_LSYS_INVA_DBGEN			BIT(12)	/* R	1		1: Enable invasive debug */
#define BIT_LSYS_NONINVA_DBGEN		BIT([11)	/* R	1		1: Enable non-invasive debug */
#define BIT_LSYS_SEC_INVA_DBGEN		BIT(10)	/* R	1		1: Enable secure invasive debug */
#define BIT_LSYS_SEC_NONINVA_DBGEN	BIT(9)	/* R	1		1: Enable secure non-invasive debug */
#define BIT_LSYS_SWD_PROTECT_DIS		BIT(8)	/* R	1		1: Disable SWD password protection;  0: Enable */
#define BIT_LSYS_SIC_SECURE_EN			BIT(7)	/* R	1		1: Permit SIC to access Secure space; 0: forbidden */
#define BIT_LSYS_SBOOT_PUBKEY_WREN	BIT(6)	/* R	1		1: Permit to PG secure boot public key; 0: fobidden */
#define BIT_LSYS_RSIP_KEY_WREN		BIT(5)	/* R	1		1: Permit to PG RSIP key; 0: fobidden */
#define BIT_LSYS_SWD_PWD_WREN		BIT(3)	/* R	1		1: Permit to PG swd password; 0: fobidden */
#define BIT_LSYS_RSIP_KEY_RDEN			BIT(2)	/* R	1		1: Permit to Read RSIP key from Efuse; 0: fobidden */
#define BIT_LSYS_SWD_PWD_RDEN		BIT(0)	/* R	1		1: Permit to Read swd password from Efuse; 0: fobidden */


/*  REG_LP_SYSTEM_CFG0 0x03F0 */
#define BIT_SYSCFG_BD_PKG_SEL			(0x00000001 << 31) /*!< 0: normal package; 1: engineering mode */
#define BIT_SysCFG_TRP_UART_IMAGE		(0x00000001 << 30)
#define BIT_SysCFG_TRP_SPSLDO_SEL		(0x00000001 << 26) /*!< Trapped Selection for SPS 0: SWR mode; 1: LDO mode */
#define BIT_SysCFG_TRP_TESTMODE_EN	(0x00000001 << 25) /*!< Trapped Selection for Test Mode 0: Normal mode; 1: Test mode */
#define BIT_MASK_SYSCFG_ALF_EN		(0x0000000F << 24) /* autoload fail */
#define BIT_MASK_SYSCFG_CHIP_TYPE		(0x00000001 << 7) /*!< TestChip ID, 1?: Test (RLE)?; 0?: MP (RL), BUT AMebaD always is 1 */
#define BIT_MASK_SYSCFG_VENDOR_ID	(0x00000003 << BIT_SHIFT_SYSCFG_VENDOR_ID) /*!<[5:4] 00: TSMC , 01: SMIC, 10: UMC */
#define BIT_SHIFT_SYSCFG_VENDOR_ID	4
#define BIT_MASK_SYSCFG_CUT_VER		(0x0000000F << BIT_SHIFT_SYSCFG_CUT_VER) /*!<[3:0] Chip version */
#define BIT_SHIFT_SYSCFG_CUT_VER		0

/*  REG_LP_SYSTEM_CFG1 0x03F4 */
#define BIT_SHIFT_SYSCFG_TRP_ICFG		28 /* "Trapped ICFG data value0: normall modeXXXX: the other mode (Test Mode)" */
#define BIT_MASK_SYSCFG_TRP_ICFG		(u32)(0x0000000f << BIT_SHIFT_SYSCFG_TRP_ICFG)
#define BIT_MCM_FLASH_FT_ICFG			(u32)(0x00000004 << BIT_SHIFT_SYSCFG_TRP_ICFG)
#define BIT_FORCE_USE_S0_ICFG			(u32)(0x0000000e << BIT_SHIFT_SYSCFG_TRP_ICFG)
#define BIT_MCM_FLASH_PG_ICFG			(u32)(0x0000000c << BIT_SHIFT_SYSCFG_TRP_ICFG)
#define BIT_SYSPLL_CLKRDY				BIT(12)	/* R	0		system pll ready flag,  1: ready */
#define BIT_SPS_BG_VLD					BIT(11)	/* R	0		SWR Bandgap valid flag,  1: valid */
#define BIT_OSC128K_CLKRDY				BIT(10)	/* R	0		OSC 128k ready flag,  1: ready */
#define BIT_XTAL32K_CLKRDY				BIT(9)	/* R	0		XTAL 32k ready flag,  1: ready */
#define BIT_SYS_XCLK_VLD				BIT(8) /*Xtal Clock Stable, 1: Clock Stable */
#define BIT_SYSCFG_ALDN_STS			BIT(0) /*!< 1: SYS CFG autoload done; 0: SYSCFG autoload not ready (if done, system reg can not write) */

/*  REG_LP_SYSTEM_CFG2 0x03F8 */
#define BIT_SOC_BOOT_FROM_JTAG			BIT(31)
#define BIT_SOC_BOOT_RSVD_BIT30			BIT(30) /* reseved */
#define BIT_SOC_BOOT_WAKE_FROM_PS		BIT(29)
#define BIT_SOC_BOOT_PATCH_FUNC0			BIT(28)
#define BIT_SOC_BOOT_PATCH_FUNC1			BIT(27)
#define BIT_SOC_BOOT_PATCH_FUNC2			BIT(26)
#define BIT_SOC_BOOT_PATCH_KM4_RUN		BIT(25)
#define BIT_SOC_BOOT_WAKE_FROM_PS_HS		BIT(24)
#define BIT_BOOT_IMG3_EXIST				BIT(23)
#define BIT_BOOT_DSLP_RESET_HAPPEN		BIT(21)	/*!<  software backup from REG_AON_BOOT_REASON1-BIT_AON_BOOT_EXIT_DSLP */
#define BIT_BOOT_KM4WDG_RESET_HAPPEN	BIT(20)	/*!<  watchdog reset, software backup from BIT4 */
#define BIT_BOOT_KM4SYS_RESET_HAPPEN		BIT(19)	/*!<  system reset, software backup from BIT3 */
#define BIT_BOOT_BOD_RESET_HAPPEN			BIT(18)	/*!<  software backup from REG_AON_BOOT_REASON1-BIT_AON_BOD_RESET_FLAG */
#define BIT_BOOT_WDG_RESET_HAPPEN		BIT(17)	/*!<  watchdog reset, software backup from BIT1 */
#define BIT_BOOT_SYS_RESET_HAPPEN			BIT(16)	/*!<  system reset, software backup from BIT0 */
#define BIT_BOOT_REASON_SHIFT				16
#define BIT_BOOT_REASON_MASK				0x3F

#define BIT_MASK_SYSCFG_ROM_INFO			(0x0000FFFF)



/* VENDOR REG */
/* #define REG_OSC_CAL							0x2840 */
#define BIT_CAL_START					BIT(31)	/* R/W	0		Write 1 to Start calibration,  auto clear to 0 when calibration done	*/
#define BIT_SHIFT_CAL_CLK_SEL			24
#define BIT_MASK_CAL_CLK_SEL			0x03	/* [25:24]	R/W	0		"Calbiration source clock selection: 2'b00:  ANA4M2'b01:  100K 2'b10/2'b11:  OSC131K"	*/	
#define BIT_SHIFT_CAL_RPT				0
#define BIT_MASK_CAL_RPT				0xFFFF	/* [15:0]	R			"Read only, Here XTAL clock is used to count N cycles of calibration clock, the total used XTAL clock cycles can be read by this register When calibration clock is ANA4M,  N = 32otherwise N= 8"	*/	

/* #define REG_OSC2M_CAL						0x2844 */						
#define BIT_SHIFT_OSC2M_CAL_RPT		16
#define BIT_MASK_OSC2M_CAL_RPT		0xFFFF	/* [31:16]	R			"Read only, Here XTAL clock is used to count N cycles of OSC2M clock, the total used XTAL clock cycles can be read by this register N is decided by 0x44[15:14]"	*/	
#define BIT_SHIFT_OSC2M_CAL_CYC_SEL	12
#define BIT_MASK_OSC2M_CAL_CYC_SEL	0x03	/* [13:12]	R/W	0		"Target cycles of OSC2M2'b00: 16 2'b01: 322'b10: 642'b11: 128"	*/	
#define BIT_SHIFT_OSC2M_CAL_DLY		8
#define BIT_MASK_OSC2M_CAL_DLY		0xF		/* [11:8]	R/W	0		HW will wait (BIT_OSC2M_CAL_DLY+1) OSC2M cycles before start to count N cycles of OSC2M clock by XTAL		*/
#define BIT_OSC2M_CAL_FEN				BIT(1)	/* R/W	0		"OSC2M Calibration function enable1: Enable,  0: Disable"		*/
#define BIT_OSC2M_CAL_START			BIT(0)	/* R/W	0		Write 1 to Start calibration,  auto clear to 0 when calibration done	*/	

