alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721dlp_sysreg.h
/* SDM REG */
/* #define REG_SDM_CTRL0						0x000 */
#define BIT_AON_SDM_ONE_CAL_EN				BIT(31)		/* [31]	R/W	0		1: Open SDM32K calibration once when first enable */
#define BIT_AON_SDM_FUNC_EN					BIT(30)		/* [30]	R/W	0		1: Enable SDM32K function*/
#define BIT_AON_SDM_DONE						BIT(27)		/* [27]	R/W	0	*/
#define BIT_AON_SDM_ALWAYS_CAL_EN			BIT(18)		/* [18]	R/W	0		1: Enable SDM32K always calibration */
#define BIT_AON_SDM_RTC_CAL_EN				BIT(17)		/* [17]	R/W	0		1: Enable SDM32K RTC trigger calibration */
#define BIT_AON_SDM_AUTO_CAL_EN				BIT(16)		/* [16]	R/W	0		1: Enable SDM32K auto calibration */

#define BIT_MASK_AUTO_CAL_MAX_ERROR			0xFFFFFFFF	/* [31:0]	R/W	0		automatic calibration error threshold, will re-calibration when source clock frequcy overrange the threshold		*/


//================= LP AON Register Address Definition =====================//
#define REG_AON_PWR_CTRL					0x0000
#define REG_AON_ISO_CTRL					0x0004
#define REG_AON_BOOT_REASON1				0x000C
#define REG_AON_LDO_CTRL0					0x0010
#define REG_AON_LDO_CTRL1					0x0014
#define REG_MEM_PMCTRL_DSLP				0x001C
#define REG_XTAL32K_CTRL0					0x0020
#define REG_XTAL32K_CTRL1					0x0024
#define REG_OSC32K_CTRL					0x002C
#define REG_AON_WAKE_TIMER0				0x0030
#define REG_AON_WAKE_TIMER0_CNT			0x0034
#define REG_AON_PAD_CTRL					0x0038
#define REG_AON_WAKE_GPIO_CTRL1			0x003C
#define REG_AON_WAKE_GPIO_CTRL2			0x0040
#define REG_AON_DBNC_CTRL					0x0044
#define REG_AON_CK32KGEN_AD				0x0048
#define REG_AON_CK32KGEN_RWD				0x004C
#define REG_AON_PMC_CTRL					0x0050
#define REG_AON_PM_OPT						0x0054
#define REG_AON_WAKE_OPT_MSK				0x0058
#define REG_AON_WAKE_OPT_STS				0x005C
#define REG_AON_SNOOZE_MSK				0x0060
#define REG_AON_SNOOZE_STS				0x0064
#define REG_AON_CHIP_PWR_DOWN_MSK		0x0068
#define REG_AON_CHIP_PWR_DOWN_STS		0x006C
#define REG_AON_TSF_BCN_CFG1				0x0090
#define REG_AON_TSF_BCN_CFG2				0x0094
#define REG_AON_TSF_CNT_LOW				0x0098
#define REG_AON_TSF_CNT_HIGH				0x009C

#define REG_AON_XTAL_CTRL					0x00C8

//================= LP SYSON Register Address Definition =====================//
#define REG_LP_SYSON_PMC_PATCH_REG		0x0150 /*!< LS_SYSON_PMC patch, autoload from LEFUSE[0x200~] */

#define REG_LP_PWR_ISO_CTRL				0x0200 /*!< 0x00: REG_SYS_PWR_CTRL, 0x02: REG_SYS_ISO_CTRL */
#define REG_LP_KM0_CTRL					0x0204
#define REG_LP_FUNC_EN0					0x0208
#define REG_LP_FUNC_EN1					0x020C
#define REG_LP_CLK_CTRL0					0x0210
#define REG_LP_CLK_CTRL1					0x0214
#define REG_LP_FLASH_CTRL					0x0218

#define REG_LP_KM4_CTRL					0x021C

#define REG_SYS_EFUSE_SYSCFG0				0x0220 /*!< BYTE0x00~0x03 */
#define REG_SYS_EFUSE_SYSCFG1				0x0224 /*!< BYTE0x04~0x07 */
#define REG_SYS_EFUSE_SYSCFG2				0x0228 /*!< BYTE0x08~0x0B: XTAL */
#define REG_SYS_EFUSE_SYSCFG3				0x022C /*!< BYTE0x0C~0x0F */
#define REG_SYS_EFUSE_SYSCFG4				0x05e0 /*!< BYTE0x10~0x13 */
#define REG_SYS_EFUSE_SYSCFG5				0x05e4 /*!< BYTE0x14~0x17 */
#define REG_SYS_EFUSE_SYSCFG6				0x05e8 /*!< BYTE0x18~0x1B */
#define REG_SYS_EFUSE_SYSCFG7				0x05eC /*!< BYTE0x1C~0x1F */

#define REG_SWD_PMUX_EN					0x0230

#define REG_LP_SWR_CTRL0					0x0240
#define REG_LP_SWR_CTRL1					0x0244
#define REG_LP_SWR_CTRL2					0x0248
#define REG_LP_SWR_CTRL3					0x024C

#define REG_LP_LDO_CTRL0					0x0250

#define REG_LP_XTAL_CTRL0					0x0260
#define REG_LP_XTAL_CTRL1					0x0264
#define REG_LP_XTAL_CTRL2					0x0268
#define REG_LP_XTAL_CTRL3					0x026C
#define REG_LP_XTAL_CTRL4					0x0270
#define REG_LP_XTAL_CTRL5					0x0274
#define REG_LP_XTAL_CTRL6					0x0278

#define REG_LP_SYSPLL_CTRL0				0x0280

#define REG_LP_OSC4M_CTRL					0x0290
#define REG_LP_OSC2M_CTRL					0x0298

#define REG_LP_DEBUG_REG					0x02A0
#define REG_LP_PINMUX_CTRL					0x02A4

#define REG_PLL_SYS_REG0					0x02B0
#define REG_PLL_SYS_REG1					0x02B4
#define REG_PLL_SYS_REG2					0x02B8
#define REG_PLL_SYS_REG3					0x02BC
#define REG_PLL_SYS_PS_REG					0x02C0

#define REG_MEM_CTRL2						0x02D8

#define REG_LP_EFUSE_CTRL0					0x02E4
#define REG_LP_EFUSE_CTRL1					0x02E8	/* 0x480002E8, is for non-secure efuse access, can only access NS_EFUSE ~[0x150~0x17F] */
#define REG_HS_EFUSE_CTRL1_S				0x0810	/* 0x50000810, is for secure efuse access, can only access TZ_EFUSE[0x150~0x17F] */
#define REG_LP_EFUSE_TEST					0x02EC

/* request RSIP Key autoload */
#define REG_LP_RSIP_KEY_CTRL				0x02F0

#define REG_LP_DSLP_INFO_SW				0x02F4 /* just software use */
#define REG_LP_SLP_WAKE_EVENT_MSK0		0x0300
#define REG_LP_SLP_WAKE_EVENT_STATUS0	0x0304
#define REG_LP_SLP_WAKE_EVENT_MSK1		0x0308
#define REG_LP_SLP_WAKE_EVENT_STATUS1	0x030C
#define REG_LP_PWRMGT_CTRL				0x0318
#define REG_LP_PWRMGT_OPTION				0x0320

#define REG_LP_WL_INTR_CTRL				0x0310
#define REG_LP_WL_POW_CTRL				0x0314
#define REG_LP_RTC_XTAL_DIV_CTRL			0x0330
#define REG_LP_UART_XTAL_DIV_CTRL			0x0334
#define REG_SWR_PSW_CTRL					0x0338
#define REG_XMODE_SW_CTRL					0x033C
#define REG_GPIO_SHDN33_CTRL				0x0340
#define REG_AUDIO_SHARE_PAD_CTRL			0x0344
#define REG_BOD_DBNC_CTRL					0x0348
/* PMC ROM Patch */
#define REG_SYSON_PMC_PATCH_GRP1_L		0x0350
#define REG_SYSON_PMC_PATCH_GRP1_H		0x0354
#define REG_SYSON_PMC_PATCH_GRP2_L		0x0358
#define REG_SYSON_PMC_PATCH_GRP2_H		0x035C
#define REG_SYSON_PMC_PATCH_GRP3_L		0x0360
#define REG_SYSON_PMC_PATCH_GRP3_H		0x0364
#define REG_SYSON_PMC_PATCH_GRP4_L		0x0368
#define REG_SYSON_PMC_PATCH_GRP4_H		0x036C
#define REG_SYSON_PMC_PATCH_GRP5_L		0x0370
#define REG_SYSON_PMC_PATCH_GRP5_H		0x0374
#define REG_SYSON_PMC_PATCH_GRP6_L		0x0378
#define REG_SYSON_PMC_PATCH_GRP6_H		0x037C

#define REG_LP_GDMA_CTRL					0x0380

#define REG_LP_BOOT_REASON0				0x03C0
#define REG_LP_BACKUP_REG1					0x03C4
#define REG_LP_BACKUP_REG2					0x03C8
#define REG_LP_BACKUP_REG3					0x03CC
#define REG_LP_BACKUP_REG4					0x03D0
#define REG_LP_BACKUP_REG5					0x03D4
#define REG_LP_BACKUP_REG6					0x03D8
#define REG_LP_BACKUP_REG7					0x03DC

#define REG_LP_EFUSE_PROTECTION			0x03E0 /* RO, Autoload From EFUSE 0x1C0/0x1C1 */

#define REG_LP_SYSTEM_CFG0					0x03F0
#define REG_LP_SYSTEM_CFG1					0x03F4
#define REG_LP_SYSTEM_CFG2					0x03F8
#define REG_LP_BOOT_CFG					REG_LP_SYSTEM_CFG2
#define REG_SOC_FUNC_EN					REG_LP_SYSTEM_CFG2

#define REG_GPIO_F9_PAD_CTRL				0x0508

//================= LP VENDOR REG Register Address Definition =====================//
#define REG_OSC_CAL							0x2840
#define REG_OSC2M_CAL						0x2844

//================= LP SDM Register Address Definition =====================//
#define REG_SDM_CTRL0						0x000
#define REG_SDM_CTRL1						0x001
#define REG_SDM_CTRL2						0x002
#define REG_SDM_CTRL3						0x003
#define REG_SDM_CTRL4						0x004
#define AUTO_CAL_MAX_ERROR				0x007

static inline u32
is_power_supply18(void)
{
	u32 temp = HAL_READ32(SYSTEM_CTRL_BASE_LP, REG_AON_LDO_CTRL0);

	if (temp & BIT_AON_V1833_SEL)
		return FALSE;
	else
		return TRUE;
}


#endif //__INC_RTL8721D_LP_SYS_ON_BIT_H
